#===============================================================================#
# 1. List
# - 서로 다른 타입 저장가능.
# - 변경 가능. (Mutable)

# Ex 1.1. 리스트 생성.
lst = []
lst = list()
lst = [[1,"test"], 3, 2.345]

# Ex 1.2. 리스트 관련 함수.
lst.append([2,3])
lst.remove(3)
print("리스트 2회 반복 출력 = ", 2*lst)
lst.reverse()
print("리스트 역순 = ", lst)
print("리스트 길이 = ", len(lst))

# Ex 1.3. 인덱싱.
lst = [10,20,30,40,50]
print("마지막방 = {0}, 마지막에서 4번째 = {1}" .format(lst[-1], lst[-4]))

# Ex 1.4. 슬라이싱 = <list>[시작:끝:간격]  (끝 인덱스는 포함되지 않음)
a = lst[2:4]
print("2,3번 인덱스 복제 => ", a)

b = lst[::2]
print("2칸 간격으로 복제 => ", b)

c = lst[:-1]
print("마지막은 복제 X => ", c)

d = lst[::-1]
print("역순으로 복제 => ", d)

# 2. Tuple
# - 서로 다른 타입 저장가능.
# - 변경 불가능 (Immutable)

# Ex 2.1. 튜플 생성
t = ()
t = tuple()
t = (1,"test", (3,4))
# t[0]=2 => Error(변경불가)