#===============================================================================#
# 1. 대입 연산 및 삭제
# Ex 1.1  swap
a,b = 2,4
b,a = a,b

# Ex 1.2. 변수 삭제
del a,b

#===============================================================================#
# 2. 연산자
# 2.1. 산술연산자
print("2+3*4-8/2 =",2+3*4-8/2)          # 사칙연산 + - * /
print("2//3 =", 2//3)                   # 정수 나누기 (내림)
print("2**4 =", 2**4)                   # 거듭제곱
print("3%2=", 3%2)                      # 나머지

# 2.2. 관계연산자 -> <= / ==
print("5==3", 5==3)
print("4>=5", 4>=5)

# 2.3. 논리연산자 -> not / or /and
# 2.4. Identity 연산자 -> is not / is (같은 메모리 주소인가?)
# 2.5. Membership 연산자 -> in / not in
x=["a","b","c"]
print("a" in x)         # a는 출력 x => a가 x안에 있는가? T/F 반환

#===============================================================================#
# 3. 형변환
print(int(3.425), float(5), sep=" / ")
