#===============================================================================#
# 1. 출력문
# - 기존 개행문자(\n \t) 사용 가능.
# - 특수문자(- " , ') 기입시 앞부분에 \ 삽입.
# - 기본 print는 줄바꿈 포함.

# Ex 1.1. 기본 출력
print("ex 03 - test print1")
print('ex 03 - test print2')
## => "" / '' 상관없음.

# Ex 1.2. 두개의 값 출력
print(1,2)                      # 출력 = 1 2
print(3,4, sep="(구분기호)")    # 출력 = 1 (구분기호) 2
print(5,6, end="")              # 줄바꿈 X

# Ex 1.3. 변수 출력
a,b,c,d = 2,4,7,9
print("\na =",a," b =",b)
print("a = %d" %a)               # " "뒤에 ,가 아닌 %를 사용 
print("c = %d, d = %d" %(c,d))  # 변수가 여러개일시 %(a,b)로 사용

x,y,z = 101, "test", 3.14
print("x = {0}, y = {1}, z = {2}" .format(x,y,z))   #  format 함수 사용 - 앞에 .붙이기 => 인덱스마냥 사용하는 방법
print(f"x = {x} , y = {y}, z = {z}")                # ""앞에 f를 붙히면 {변수}로 그냥 출력 가능 => [권장]

#===============================================================================#
# 2. 입력문
name = input("입력시 보여줄 텍스트 > ")             # 기본 입력은 string
num = int(input("test 정수 > "))                    # 입력을 형변환 후 대입 연산하는 경우


